app/controllers/end_users/end_users/registrations_controller.rb

  def edit
    @end_user = EndUser.find(current_end_user.id)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."deleted_at" IS NULL AND "end_users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def update
    @end_user = EndUser.find(current_end_user.id)
    if @end_user.update(end_user_params)
---
SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "end_users" SET "post_code" = ?, "updated_at" = ? WHERE "end_users"."id" = ?  [["post_code", "ajajajajafafafa"], ["updated_at", "2020-06-07 16:37:04.889131"], ["id", 8]]